task6/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       159400;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       159800;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       160200;
    }
    atmosphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       160400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160000;
        startFace       160600;
    }
)

// ************************************************************************* //
