task6/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water-glycerol oxygen);

water-glycerol
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 6.2241e-05;
    rho             [1 -3 0 0 0 0 0] 1205;
}

oxygen
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.6257e-05;
    rho             [1 -3 0 0 0 0 0] 1.122;
}

sigma           [1 0 -2 0 0 0 0] 0.07;


// ************************************************************************* //
