task6/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)
    (5 0 0)
    (5 10 0)
    (0 10 0)
    (0 0 1)
    (5 0 1)
    (5 10 1)
    (0 10 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 400 1) simpleGrading (1 1 1)
);
edges
(
    
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
			(0 4 7 3)
        );
    }
    
    rightWall
    {
        type wall;
        faces
        (
			(1 2 6 5)
        );
    }
    
    lowerWall
    {
        type wall;
        faces
        (
			(0 1 5 4)
        );
    }
    
    atmosphere
    {
        type wall;
        faces
        (
			(2 3 7 6)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
